In [6]:
import pandas as pd
df= pd.DataFrame({
    'ADDRESS':('56th,ben colony,btm layout,banaglore,78909,3rd,april,2022,5hr,55min,8sec',
                '20th street,jonhs road,whitefield,bangalore,567,6th,dec,2021,0.280704741')})

#1st method (Split text to multiple columns with dataframe)



df[["house no","street","city","state","zipcode","day","month","year","hr","mm","ss"]]=df["ADDRESS"].str.split(",",expand=True)
df

#2nd method (Split text to multiple column by delimiter)
df["ADDRESS"].str.split(',',expand=True)
df

,ADDRESS,house no,street,city,state,zipcode,day,month,year,hr,mm,ss
0,"56th,ben colony,btm layout,banaglore,78909,3rd...",56th,ben colony,btm layout,banaglore,78909,3rd,april,2022,5hr,55min,8sec
1,"20th street,jonhs road,whitefield,bangalore,56...",20th street,jonhs road,whitefield,bangalore,567,6th,dec,2021,0.280704741,None,None

In [12]:
from datetime import datetime
 
timestamp=float(df.hr[1])
dt_obj = datetime.fromtimestamp(timestamp)
 
print("date_time:",dt_obj)
print("type of dt:",type(dt_obj))

date_time: 1970-01-01 05:30:00.280705
type of dt: <class 'datetime.datetime'>

In [5]:
dt_obj = datetime.fromtimestamp(timestamp).strftime('%d-%m-%y')
 
print("date:",dt_obj)

date: 01-01-70

In [ ]:
day=[]
month=[]
year=[]
from datetime import datetime
ld=len(DT) 
for i in DT:
    day.append(i.day)
    month.append(i.month)
    year.append(i.year) 
print(day)
print(month)
print(year)